<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="UTF-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <link rel="stylesheet" href="./Styles/style.css" />
    <link rel="icon" type="image/png" href="./Images/vue_icon.svg" />
    <link
      href="https://fonts.googleapis.com/css2?family=Roboto:wght@300;500&display=swap"
      rel="stylesheet"
    />
    <title>VUE History</title>
  </head>
  <body id="body">
    <section>
      <div class="container">
        <div class="title-container">
          <h1>VUE.JS</h1>
        </div>
      </div>
    </section>
    <section>
      <div class="container-cards">
        <div class="container-card">
          <a href="#pregunta1">
            <figure>
              <img src="./Images/Vue.jpeg" alt="Vuejs" class="front-face" />
              <figcaption class="back-face">
                <h2 class="title">
                  ¿Cu&aacute;les son los valores fundamentales sobre los cuales
                  el creador de VUE.js se basa para sentirse impulsado a seguir
                  trabajando de una manera excelente?
                </h2>
              </figcaption>
            </figure>
          </a>
        </div>
        <div class="container-card">
          <a href="#pregunta2">
            <figure>
              <img src="./Images/Vue.jpeg" alt="Vuejs" class="front-face" />
              <figcaption class="back-face">
                <h2 class="title">
                  ¿Que impuls&oacute; inicialmente al creador de VUE para hacer
                  este proyecto?
                </h2>
              </figcaption>
            </figure>
          </a>
        </div>
        <div class="container-card">
          <a href="#pregunta3">
            <figure>
              <img src="./Images/Vue.jpeg" alt="Vuejs" class="front-face" />
              <figcaption class="back-face">
                <h2 class="title">
                  Para el creador de VUE ¿Que es lo que le da a &eacute;l la
                  medida de &eacute;xito de lo que ha hecho?
                </h2>
              </figcaption>
            </figure>
          </a>
        </div>
        <div class="container-card">
          <a href="#pregunta4">
            <figure>
              <img src="./Images/Vue.jpeg" alt="Vuejs" class="front-face" />
              <figcaption class="back-face">
                <h2 class="title">
                  ¿Que diferencia a VUE de otros frameworks?
                </h2>
              </figcaption>
            </figure>
          </a>
        </div>
        <div class="container-card">
          <a href="#pregunta5">
            <figure>
              <img src="./Images/Vue.jpeg" alt="Vuejs" class="front-face" />
              <figcaption class="back-face">
                <h2 class="title">
                  ¿Que ocasion&oacute; que subiera el prestigio de VUE
                  dr&aacute;sticamente?
                </h2>
              </figcaption>
            </figure>
          </a>
        </div>
      </div>
    </section>
    <section>
      <div class="container-answers">
        <div class="answer-content" id="pregunta1">
          <p>
            1) <br />
            Relacionarse con la comunidad, proporcionar herramientas adicionales
            y apoyo, otro valor importante fue c&oacute;mo las personas
            empezaban a interesarse por probarlo, y de hecho todo aquel que
            hac&iacute;a su aporte aunque no fuera al proyecto open source, Evan
            lo invitaba a formar parte del proyecto. El pensar que no solamente
            personas de habla ingl&eacute;s podr&iacute;an probar o aprender un
            nuevo framework sin duda es una gran iniciativa para poder incluir y
            hacer que la comunidad creciera mucho m&aacute;s, que m&aacute;s
            personas conociera VUE.js
          </p>
        </div>
      </div>
      <div class="container-answers">
        <div class="answer-content" id="pregunta2">
          <p>
            2) <br />
            Una de las cosas que lo impuls&oacute; fu&eacute; que trataba de
            utilizar algunos de los frameworks pero que estos muchas veces sus
            opciones no estaban realmente resolviendo sus problemas. Algunos le
            proporcionaban estructura de una aplicaci&oacute;n, pero no le
            proporcionaba interactividad con la vista. Le surge la idea de
            ¿C&oacute;mo podr&iacute;a hacer su trabajo m&aacute;s eficiente? Se
            le ocurri&oacute; crear un framework propio, al ver que el proyecto
            inicial se hizo algo popular a pesar de que Evan lo estaba creando
            para &eacute;l mismo, como un proyecto personal, su expectativa era
            crear un framework que en lo personal le gustara y de construir algo
            que las personas en realidad usen.
          </p>
        </div>
      </div>
      <div class="container-answers">
        <div class="answer-content" id="pregunta3">
          <p>
            3) <br />
            El sentirlo orgulloso de s&iacute; mismo, estar trabajando en algo
            que le apasiona, y lo m&aacute;s importante que le da la medida de
            &eacute;xito es saber como miles de personas quieren estrechar su
            mano y decirle gracias por hacer esto que hace mi vida mucho
            m&aacute;s fácil.
          </p>
        </div>
      </div>
      <div class="container-answers">
        <div class="answer-content" id="pregunta4">
          <p>
            4) <br />
            El trabajo en colaboraci&oacute;n es uno de los aspectos m&aacute;s
            importantes que diferencian a VUE.js de otros frameworks, el saber
            que no solamente es una persona “genio” quien es el que tomas las
            decisiones de que se implementa y lo que no, sino que todos trabajan
            en colaboraci&oacute;n, que no es un proyecto impulsado por una
            empresa grande como Google con Angular o Facebook con React y esto
            hace que quien hace las reglas son las personas y no empresas.
          </p>
        </div>
      </div>
      <div class="container-answers">
        <div class="answer-content" id="pregunta5">
          <p>
            5) <br />
            El saber que formas parte de algo, que te sientes muy unido y
            aceptado en una comunidad, el hecho de que las personas
            conectar&aacute;n con el creador del framework cre&oacute; un
            v&iacute;nculo muy grande, hac&iacute;a que muchas m&aacute;s
            personas se unieran a aprender VUE.js y que lo m&aacute;s importante
            que les gustara ser parte de este. Evan tiene muy bien definido para
            donde quiere dirigir todo el framework y eso le ocasiona un gran
            prestigio a VUE.js
          </p>
        </div>
      </div>
    </section>
    <script src="./JavaScript/app.js"></script>
  </body>
</html>
